In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 30, 0, 22, 7), 91, 'free', None, None, 829, 'Dallas-Fort Worth-Arlington, TX', 'Mozilla/5.0 (compatible; MSIE 10.0; Windows NT 6.2; WOW64; Trident/6.0)'),
 (2, datetime.datetime(2018, 11, 30, 1, 8, 41), 73, 'paid', None, None, 1049, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (3, datetime.datetime(2018, 11, 30, 1, 12, 48), 73, 'paid', None, None, 1049, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (4, datetime.datetime(2018, 11, 30, 1, 17, 5), 73, 'paid', None, None, 1049, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (5, datetime.datetime(2018, 11, 30, 1, 20, 56), 73, 'paid', None, None, 1049, 'Tampa-St. Petersburg-Clearwater, FL', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(92, 'Ryann', 'Smith', 'F', 'free'),
 (78, 'Chloe', 'Roth', 'F', 'free'),
 (73, 'Jacob', 'Klein', 'M', 'paid'),
 (12, 'Austin', 'Rosales', 'M', 'free'),
 (86, 'Aiden', 'Hess', 'M', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, 218.93179)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('ARD7TVE1187B99BFB1', 'NaN', 'NaN', nan, nan)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 30, 0, 22, 7), 0, 30, 48, 11, 2018, True),
 (datetime.datetime(2018, 11, 30, 1, 8, 41), 1, 30, 48, 11, 2018, True),
 (datetime.datetime(2018, 11, 30, 1, 12, 48), 1, 30, 48, 11, 2018, True),
 (datetime.datetime(2018, 11, 30, 1, 17, 5), 1, 30, 48, 11, 2018, True),
 (datetime.datetime(2018, 11, 30, 1, 20, 56), 1, 30, 48, 11, 2018, True)]

In [8]:
%sql select * from songplays where song_id is not null and artist_id is not null

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [9]:
%run -i etl.py

76 files found in data/song_data
1/76 files processed.
2/76 files processed.
3/76 files processed.
4/76 files processed.
5/76 files processed.
6/76 files processed.
7/76 files processed.
8/76 files processed.
9/76 files processed.
10/76 files processed.
11/76 files processed.
12/76 files processed.
13/76 files processed.
14/76 files processed.
15/76 files processed.
16/76 files processed.
17/76 files processed.
18/76 files processed.

/opt/conda/lib/python3.6/site-packages/pandas/core/series.py:851: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

19/76 files processed.
20/76 files processed.
21/76 files processed.
22/76 files processed.
23/76 files processed.
24/76 files processed.
25/76 files processed.
26/76 files processed.
27/76 files processed.
28/76 files processed.
29/76 files processed.
30/76 files processed.
31/76 files processed.
32/76 files processed.
33/76 files processed.
34/76 files processed.
35/76 files processed.
36/76 files processed.
37/76 files processed.
38/76 files processed.
39/76 files processed.
40/76 files processed.
41/76 files processed.
42/76 files processed.
43/76 files processed.
44/76 files processed.
45/76 files processed.
46/76 files processed.
47/76 files processed.
48/76 files processed.
49/76 files processed.
50/76 files processed.
51/76 files processed.
52/76 files processed.
53/76 files processed.
54/76 files processed.
55/76 files processed.
56/76 files processed.
57/76 files processed.
58/76 files processed.
59/76 files processed.
60/76 files processed.
61/76 files processed.
62/76 files processed.
63/76 files processed.
64/76 files processed.
65/76 files processed.
66/76 files processed.
67/76 files processed.
68/76 files processed.
69/76 files processed.
70/76 files processed.
71/76 files processed.
72/76 files processed.
73/76 files processed.
74/76 files processed.
75/76 files processed.
76/76 files processed.
31 files found in data/log_data
1/31 files processed.
2/31 files processed.
3/31 files processed.
4/31 files processed.
5/31 files processed.
6/31 files processed.
7/31 files processed.
8/31 files processed.
9/31 files processed.
10/31 files processed.
11/31 files processed.
12/31 files processed.
13/31 files processed.
14/31 files processed.
15/31 files processed.
16/31 files processed.
17/31 files processed.
18/31 files processed.
19/31 files processed.
20/31 files processed.
21/31 files processed.
22/31 files processed.
23/31 files processed.
24/31 files processed.
25/31 files processed.
26/31 files processed.
27/31 files processed.
28/31 files processed.
29/31 files processed.
30/31 files processed.
31/31 files processed.